

/*=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=*/
/* @author    정성화
/* @e-mail    JackRyan0903@gmail.com
/* @Copyright 2015년 1월 1일 목요일  오후 8:24:21. Jack Ryan all rights reserved.
/*=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=*/


#pragma once

/*=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=*/
/*  @포함
/*=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=*/
#include <iostream>				// std::cout
#include <string>				// std::string
#include <stdexcept>			// std::runtime_error


/*=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=*/
/*  @링크
/*  @설명
/*      1. #pragma comment(linker, "/entry:WinMainCRTStartup /subsystem:console" )
/*          : window 창과 같이 console창을 띄울수 있게 해줌.
/*=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=*/
#ifdef _DEBUG
#pragma comment(linker, "/entry:WinMainCRTStartup /subsystem:console" )

//================================================================================//
//  @네임스페이스
//  @포함 함수
//      1. consoleMessage() : 콘솔로 메시지를 전달하는 함수. (2가지 오버로딩)
//================================================================================//
namespace Debug{

    //================================================================================//
    //  @함수
    //  @설명 : 파라미터로 받은 string 값을 cout을 이용하여 콘솔에 출력.
    //================================================================================//
    static void consoleMessage(const std::string& message)
    {

        std::cout << message << std::endl;
		
    }

    //================================================================================//
    //  @함수
    //  @설명 : 입력받은 두 개의 int 값을 마우스 좌표로 가정하고 cout을 이용하여 콘솔에 출력.
    //================================================================================//
    static void consoleMessage(const int &mouseX, const int &mouseY)
    {

        std::cout << "Mouse Position -> X : " << mouseX << " Y : " << mouseY << std::endl;

    }

}
#endif